Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 155, 220, 1) 0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 155, 220, 1) 0                                            
__________________________________________________________________________________________________
sequential (Sequential)         (None, 128)          6461084     input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 1)            0           sequential[0][0]                 
                                                                 sequential[1][0]                 
==================================================================================================
Total params: 6,461,084
Trainable params: 6,460,974
Non-trainable params: 110
__________________________________________________________________________________________________



Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1_1 (Conv2D)             (None, 37, 53, 96)        11712     
_________________________________________________________________
batch_normalization (BatchNo (None, 37, 53, 96)        148       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 18, 26, 96)        0         
_________________________________________________________________
zero_padding2d (ZeroPadding2 (None, 22, 30, 96)        0         
_________________________________________________________________
conv2_1 (Conv2D)             (None, 18, 26, 256)       614656    
_________________________________________________________________
batch_normalization_1 (Batch (None, 18, 26, 256)       72        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 12, 256)        0         
_________________________________________________________________
dropout (Dropout)            (None, 8, 12, 256)        0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 10, 14, 256)       0         
_________________________________________________________________
conv3_1 (Conv2D)             (None, 8, 12, 384)        885120    
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 10, 14, 384)       0         
_________________________________________________________________
conv3_2 (Conv2D)             (None, 8, 12, 256)        884992    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 5, 256)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 5, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 3840)              0         
_________________________________________________________________
dense (Dense)                (None, 1024)              3933184   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               131200    
=================================================================
Total params: 6,461,084
Trainable params: 6,460,974
Non-trainable params: 110
_________________________________________________________________